INSERT INTO "ProductCategory" (id, name, description, "createdAt", "updatedAt")
VALUES
  (uuid_generate_v4(), 'Ліки та профілактичні засоби', 'Категорія для ліків, які застосовуються для лікування та профілактики різних захворювань.', now(), now()),
  (uuid_generate_v4(), 'Вітаміни та мінерали', 'Продукти, що містять вітаміни, мінерали та інші корисні добавки для покращення здоров’я.', now(), now()),
  (uuid_generate_v4(), 'Краса та догляд', 'Товари для догляду за шкірою, волоссям, нігтями та для покращення зовнішнього вигляду.', now(), now()),
  (uuid_generate_v4(), 'Спорт та здоров''я', 'Продукти, що підтримують фізичну активність, спортивні добавки та інше для підтримки здоров’я.', now(), now()),
  (uuid_generate_v4(), 'Товари для дітей та мам', 'Продукти для здоров’я дітей та матерів, включаючи засоби для догляду та харчування.', now(), now()),
  (uuid_generate_v4(), 'Вироби медичного призначення', 'Медичні вироби, що використовуються для діагностики та лікування пацієнтів.', now(), now()),
  (uuid_generate_v4(), 'Ортопедія та реабілітація', 'Товари для реабілітації, протези, ортопедичні засоби для відновлення після травм.', now(), now()),
  (uuid_generate_v4(), 'Медична техніка', 'Медичні прилади для діагностики, моніторингу та лікування пацієнтів.', now(), now()),
  (uuid_generate_v4(), 'Зоотовари', 'Товари для догляду та утримання домашніх тварин, включаючи їжу, аксесуари та ліки для тварин.', now(), now());

-- Insert 10 test pharmacies with real data from Chernivtsi
INSERT INTO "Pharmacy" ("id", "createdAt", "updatedAt", "name", "address", "lat", "lng")
VALUES
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №12', 'вул. Героїв Майдану, 18, Чернівці', '48.28629', '25.93344'),
  (uuid_generate_v4(), NOW(), NOW(), 'Med-Servis Pharmacy', 'проспект Незалежності, 115, Чернівці', '48.2901', '25.9451'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №13', 'вул. Небесної Сотні, 6, Чернівці', '48.2856', '25.9410'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №14', 'вул. Головна, 4, Чернівці', '48.2960', '25.9333'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №15', 'вул. Грекова, 8, Чернівці', '48.2831', '25.9367'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №16', 'вул. Кармелюка, 5, Чернівці', '48.2895', '25.9378'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №17', 'вул. Лесі Українки, 15, Чернівці', '48.2850', '25.9361'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №18', 'вул. Остромич, 9, Чернівці', '48.2920', '25.9395'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №19', 'вул. Молодіжна, 23, Чернівці', '48.2835', '25.9370'),
  (uuid_generate_v4(), NOW(), NOW(), 'Аптека №20', 'вул. Шевченка, 9, Чернівці', '48.2815', '25.9313');


