import { Divider, Stack, Typography } from "@mui/material";
import "./Busket.css";
import { ProductElement } from "./Product";

export const Busket = () => {
  const products = [
    {
      name: "Цитрамон-Дарниця таблетки №6",
      price: 15.9,
      description: `Фармакодинаміка.
    Лікарський засіб чинить аналгезивну, жарознижувальну та протизапальну дію. Компоненти, що входять до складу лікарського засобу, посилюють ефекти один одного.
    Антипіретичний ефект ацетилсаліцилової кислоти реалізується через центральну нервову систему шляхом пригнічення синтезу РGF2 у гіпоталамусі у відповідь на вплив ендогенних пірогенів. Аналгетичний ефект має як периферичне, так і центральне походження: периферичний ефект – пригнічення синтезу простагландинів запалених тканин; центральний ефект – вплив на центри гіпоталамуса. Ацетилсаліцилова кислота також зменшує агрегацію тромбоцитів.
    Парацетамол чинить аналгезивну, жарознижувальну і дуже слабку протизапальну дію, що пов'язано з його впливом на центр терморегуляції в гіпоталамусі та слабко вираженою здатністю інгібувати синтез простагландинів у периферичних тканинах.
    Кофеїн збуджує центральну нервову систему. Кофеїн підвищує позитивні умовні рефлекси, стимулює рухову активність, послаблює дію снодійних і наркотичних речовин, посилює дію аналгетиків і жарознижувальних засобів.
    Фармакокінетика.

Не вивчалась.`,
    },
    {
      name: "Цитрамон-Дарниця таблетки №10",
      price: 31.0,
      description: `Фармакодинаміка.

Лікарський засіб чинить аналгезивну, жарознижувальну та протизапальну дію. Компоненти, що входять до складу лікарського засобу, посилюють ефекти один одного.

Антипіретичний ефект ацетилсаліцилової кислоти реалізується через центральну нервову систему шляхом пригнічення синтезу РGF2 у гіпоталамусі у відповідь на вплив ендогенних пірогенів. Аналгетичний ефект має як периферичне, так і центральне походження: периферичний ефект – пригнічення синтезу простагландинів запалених тканин; центральний ефект – вплив на центри гіпоталамуса. Ацетилсаліцилова кислота також зменшує агрегацію тромбоцитів.

Парацетамол чинить аналгезивну, жарознижувальну і дуже слабку протизапальну дію, що пов'язано з його впливом на центр терморегуляції в гіпоталамусі та слабко вираженою здатністю інгібувати синтез простагландинів у периферичних тканинах.

Кофеїн збуджує центральну нервову систему. Кофеїн підвищує позитивні умовні рефлекси, стимулює рухову активність, послаблює дію снодійних і наркотичних речовин, посилює дію аналгетиків і жарознижувальних засобів.

Фармакокінетика.

Не вивчалась.`,
    },
  ];

  return (
    <div className="basket">
      <Typography variant="h4" m={2}>
        Кошик
      </Typography>
      <Stack divider={<Divider orientation="horizontal" />} gap={2}>
        <div className="ProductList"></div>
        {products.map((product) => (
          <ProductElement key={product.name} props={product} />
        ))}
        {/* <div className="ProductList"></div> */}
      </Stack>
    </div>
  );
};
